{
  "website":{
    "title": "Блогот на Игор"
  },
  "nav":{
    "home": "Дома",
    "about_me": "За",
    "skills": "Вештини",
    "projects": "Проекти",
    "career": "Кариера",
    "blog": "Блог",
    "link": "Врски"
  },
  "about_me":{
    "about_me": "За мене",
    "des": "М-р по електротехника и ИТ и технички водач."
  },
  "skills":{
    "my_skills": "Мои вештини"
  },
  "projects":{
    "my_projects": "Мои проекти",
    "pdc": "Интеграција на VOIP сервиси и метаподатоци во разни CRM системи.",
    "hls": "HLS сервер за аудио процесирање и стрим во реално време развиен со Bash и Nginx.",
    "cc": "Ц Компајлер развиен во Јава и JavaCC парсер генераторот. Резултатот е асемблерски код за доверлив процесор со оригинално инструкциско множество, развиен од IHP институтот за микроелектроника во Франкфурт (Одра).",
    "esa": "Веб апликација за пријавување на масовни несреќи низ Светот. Изграден со Liferay CMS за додавање и управување со содржината. Учествував во специјализација на Liferay CMS за потребите на клиентот.",
    "apc": "Систем за иницирање на отворање на порта во зависност од близината до целта. Системот се состои од андроид апликација и сервер кој што управува со додавањето на локации за ѕвонење.",
    "rte": "Систем кој обединува пријавување настани до полиција, пожарна и прва помош. Се состои од мобилна апликација за пријавување настани во реално време и сервер што управува со податоците.",
    "sunb": "Андроид апликација за далечинско управување со електрични уреди со помош на Bluetooth Low Energy протоколот.",
    "ubs": "Веб Апликација - калкулатор и финансиски советник што обединува повеќе системи и врши пресметки за хипотеки и кредити.",
    "wht": "Веб Апликација - калкулатор за пресметка на данок за разновидни трансакции според законите на повеќе земји.",
    "tie": "Систем за организирање на податоци за пациенти од разни болници и споделување на податоците помеѓу болници.",
    "tt": "Систем за додавање и бележење на време за сите вработени со механизми за генерирање на репорти за потрошеното време.",
    "pog": "JavaFx Десктоп апликација за лесно тагирање и пребарување на фотографиите во вашиот компјутер.",
    "ldap": "Веб интерфејс за менаџирање на LDAP корисници (Додавање корисник, менување атрибути, менување шифра).",
    "rlb": "Андроид апликација за далечинсо управување на температура, режим на работа, брзина на вентилатор и дополнителни параметри преку Wi-Fi.",
    "conf": "Веб апликација базирана на Atlassian Confluence со специјализација за потребите на компанијата. Вклучува плагини за управување и приказ на содржина, планер за состаноци, организер на податоци, и сл.",
    "hwsw2010": "Системот овозможува 3Д мапирање на патека. Вклучува робот кој што праќа податоци преку Bluetooth до персонален компјутер, којшто ја прикажува патека на движење на роботот.",
    "hwsw2011": "Систем за автономно истражување на непознат терен по моделот на Марс роверот. Системот се состои од RP6 робот, RFID читач, GPRS модем, жироскоп, dsPIC микроконтролер и персонален компјутер."
  },
  "career":{
    "my_career": "Моја кариера",
    "my_education": "Мое образование",
    "sentice": "Сентице Тецх ДООЕЛ",
    "sentice_desc": "Меѓу првите вработени, одговорен за поставување и одржување на внатрешната инфраструктура на компанијата. Работам на повеќе проекти изработени во неколку различни програмски јазици.",
    "sentice_date": "Август 2015",
    "sentice_job": "Сениор софтверски инжeнер, технички водач и систем администратор",
    "netcetera": "Нетцетера ДООЕЛ",
    "netcetera_desc": "Мојата професионална кариера ја започнав во Нетцетера, каде бев вклучен во повеќе Java EE технологии, вклучувајќи: Spring, Hibernate, JDBC, Servlets, JSP, Struts, и тн. Стекнав значајно искуство.",
    "netcetera_date": "Јуни 2012",
    "netcetera_job": "Јава софтверски инжeнер",
    "feit": "Факултет за електротехника и ИТ, УКИМ Скопје",
    "feit_msc_date": "Ноември 2011",
    "feit_msc_desc": "Продолжив со втор циклус на студии каде изучував повеќе предмети од областите на Систем во чип и наноелектроника. Развив Ц компајлер за доверлив процесор како дел од магистерската теза.",
    "feit_msc_job": "Магистерски студии",
    "feit_ta_date": "Февруари 2011",
    "feit_ta_desc": "Моја задача беше помош на студентите при извршување на задачи на лабораториски вежби. Работев со микроконтролерот PIC16F877a. Предмет: Микроелектроника.",
    "feit_ta_job": "Демонстратор",
    "feit_bsc_date": "Октомври 2007",
    "feit_bsc_desc": "Стекнав солидна основа од наука и инженерство. Учествував на неколку натпревари меѓу кои и меѓународниот натпревар Hardware & Software каде што нашиот тим го освои првото место.",
    "feit_bsc_job": "Додипломски студии"
  },
  "blog":{
    "my_blog": "Мој Блог"
  },
  "link":{
    "link": "Врски",
    "view": "прегледи"
  }

}
